Задача:

Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел.

Используйте метод split строки. 

Решение задачи:

# put your python code here


list = [int(i) for i in input().split()]
res = sum(list)
print(res)