Задача 1:

Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел.

Используйте метод split строки. 

Решение задачи 1:

list = [int(i) for i in input().split()]
res = sum(list)
print(res)


Задача 2:
Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента этого списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей считается элемент, находящий на противоположном конце этого списка. Например, если на вход подаётся список "1 3 5 6 10", то на выход ожидается список "13 6 9 15 7" (без кавычек).

Если на вход пришло только одно число, надо вывести его же.

Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.

Решение задачи 2:


list = [int(i) for i in input().split()]
n = len(list)
if n == 1:
    print(list[0])

else:  
    for i in range(n):
        if i < n - 1:
            print(list[i-1] + list[i+1], end = ' ')
        else:
            print(list[0] + list[i-1])
