# Задача
Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.

Кодирование осуществляется следующим образом:
s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот символ и количество его повторений в этой позиции строки.

Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.

## Решение задачи

```python
# put your python code here

string = input()
answer = ''
symbol = string[0]
symbol_count = 0

for letter in string:
# переменная letter пробегает по элементам введенной строки, 
# т.е. на каждой итерации она будет проверять значение какого-либо элемента
    if letter == symbol:  
        symbol_count += 1
    else: 
	answer += symbol + str(symbol_count)
        symbol_count = 1 
# т.к. попадем сюда, когда мы уже нашли новый элемент, т.е. одно вхождение уже есть)
        symbol = letter 
# сохранили в symbol новый элемент, который нашли
# запишем, сколько раз в строку входил самый последний элемент (иначе мы его не учтем, т.к. цикл for заканчивется и мы ни в if, ни в else не попадем) 
answer += symbol + str(symbol_count)
print(answer)
```